{
  "id": "cbd2fd63-885b-48c4-8a6b-b5cb3044255d",
  "name": "I\u0027m having a bad day",
  "auto": true,
  "contexts": [],
  "responses": [
    {
      "resetContexts": false,
      "affectedContexts": [
        {
          "name": "Imhavingabadday-followup",
          "parameters": {},
          "lifespan": 2
        }
      ],
      "parameters": [],
      "messages": [
        {
          "type": 0,
          "lang": "en",
          "speech": [
            "According to all known laws of aviation, there is no way that a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyway. Because bees don’t care what humans think is impossible.” SEQ. 75 - “INTRO TO BARRY” INT. BENSON HOUSE - DAY ANGLE ON: Sneakers on the ground. Camera PANS UP to reveal BARRY BENSON’S BEDROOM ANGLE ON: Barry’s hand flipping through different sweaters in his closet. BARRY Yellow black, yellow black, yellow black, yellow black, yellow black, yellow black...oohh, black and yellow... ANGLE ON: Barry wearing the sweater he picked, looking in the mirror. BARRY (CONT’D) Yeah, let’s shake it up a little. He picks the black and yellow one. He then goes to the sink, takes the top off a CONTAINER OF HONEY, and puts some honey into his hair. He squirts some in his mouth and gargles. Then he takes the lid off the bottle, and rolls some on like deodorant. CUT TO: INT. BENSON HOUSE KITCHEN - CONTINUOUS Barry’s mother, JANET BENSON, yells up at Barry. JANET BENSON Barry, breakfast is ready! CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 1. INT. BARRY’S ROOM - CONTINUOUS BARRY Coming! SFX: Phone RINGING. Barry’s antennae vibrate as they RING like a phone. Barry’s hands are wet. He looks around for a towel. BARRY (CONT’D) Hang on a second! He wipes his hands on his sweater, and pulls his antennae down to his ear and mouth. BARRY (CONT\u0027D) Hello? His best friend, ADAM FLAYMAN, is on the other end. ADAM Barry? BARRY Adam? ADAM Can you believe this is happening? BARRY Can’t believe it. I’ll pick you up. Barry sticks his stinger in a sharpener. SFX: BUZZING AS HIS STINGER IS SHARPENED. He tests the sharpness with his finger. SFX: Bing. BARRY (CONT’D) Looking sharp. ANGLE ON: Barry hovering down the hall, sliding down the staircase bannister. Barry’s mother, JANET BENSON, is in the kitchen. JANET BENSON Barry, why don’t you use the stairs? Your father paid good money for those. \"Bee Movie\" - JS REVISIONS 8/13/07 2. BARRY Sorry, I’m excited. Barry’s father, MARTIN BENSON, ENTERS. He’s reading a NEWSPAPER with the HEADLINE, “Queen gives birth to thousandtuplets: Resting Comfortably.” MARTIN BENSON Here’s the graduate. We’re very proud of you, Son. And a perfect report card, all B’s. JANET BENSON (mushing Barry’s hair) Very proud. BARRY Ma! I’ve got a thing going here. Barry re-adjusts his hair, starts to leave. JANET BENSON You’ve got some lint on your fuzz. She picks it off. BARRY Ow, that’s me! MARTIN BENSON Wave to us. We’ll be in row 118,000. Barry zips off. BARRY Bye! JANET BENSON Barry, I told you, stop flying in the house! CUT TO: SEQ. 750 - DRIVING TO GRADUATION EXT. BEE SUBURB - MORNING A GARAGE DOOR OPENS. Barry drives out in his CAR. \"Bee Movie\" - JS REVISIONS 8/13/07 3. ANGLE ON: Barry’s friend, ADAM FLAYMAN, standing by the curb. He’s reading a NEWSPAPER with the HEADLINE: “Frisbee Hits Hive: Internet Down. Bee-stander: “I heard a sound, and next thing I knew...wham-o!.” Barry drives up, stops in front of Adam. Adam jumps in. BARRY Hey, Adam. ADAM Hey, Barry. (pointing at Barry’s hair) Is that fuzz gel? BARRY A little. It’s a special day. Finally graduating. ADAM I never thought I’d make it. BARRY Yeah, three days of grade school, three days of high school. Are you feeling better?",
            "Ryan: A long time ago\nIn a land far away\nLived a Pineapple Princess Tiki\nShe was sweet as a peach\nIn a pineapple way\nBut so sad that she hardly speaky\n\nSo if you listen well\nYou\u0027ll hear her secret wish\n\nSharpay: Aloha everybody, my name is Tiki\nI long to free\nA truly remarkable fish\nCHORUS\nSharpay: (My sweet prince)\nHumu humu nuku nuku apua\u0027a\nMaka heekee mala heenee who\nHumu humu nuku nuku apua\u0027a\nOooooooooh\nHawana\nWaka waka waka\nNeekee pu pu pu\n\n(Spoken) Ryan, the fog?\n\nRyan: She dreams of a boy\nWho is under a spell\nThat has left him all\nWet and scaly\n\nSharpay: I sing from my heart\nOf the power of love\nJust a girl with a uka...\n\nR and S: ...lele\nCome to me (Come to her)\nMy sweet one\nAnd be still (Be still)\n\nSharpay: I\u0027ll grasp your tail\nThen stroke each tender gill\n\nCHORUS\nSharpay: (My sweet prince)\nHumu humu nuku nuku apua\u0027a\nMaka heele mala heenee who\nHumu humu nuku nuku apua\u0027a\nOooooooooh\nHawana\n\nWaka waka waka\nNeekee pu pu pu\n\nSpoken: Now this is where we lean into\nthe whole Kabuki thing\n\nR \u0026 S: The clouds turned grey\nAnd the big sky cried\nAnd the ocean had a fit\n\nSpoken: Ryan, where\u0027s my ocean?\n\nR \u0026 S: Then the wind went whoosh\nAnd thunder cracked\nAnd the Mighty Mount Fufu spit\n\nSpoken: Mighty Mount Fufu spit!\n\nR \u0026 S: Tiki, Tiki, Tiki\nWanna speaky, speaky, speaky\nWith the mighty spirit fufu\nTiki,Tiki,Tiki\nWanna Speaky, speaky, speaky\n\nSharpay: So words I do not mince\nPlease Make a man of my\nFresh fish prince\n\nThis is real fish talk, no lie\n(Sharpay speaking a fish language)\nAnd then the fish turns\nInto a gorgeous prince\nAnd sings...\n\nSharpay\n(In a male voice)\n\nI\u0027m prince\nHumu humu nuku nuku apua\u0027a\nMaka heekee mala heenee who\n(With me!)\nHumu humu nuku nuku apua\u0027a\nOooooooooh\nHawana\nWaka waka waka\nNeekee pu pu pu\n\nSharpay: Everybody!\n\nCHORUS\n\nEverbody: Humu humu nuku nuku apua\u0027a\nMaka heekee mala heenee who\nHumu humu nuku nuku apua\u0027a\nOooooooooh\nHawana\nWaka waka waka\nNeekee pu pu pu (reapeat 2x)\npuuuuuu\npuuuuuu",
            "What is my perfect crime? I break into Tiffany\u0027s at midnight. Do I go for the vault? No, I go for the chandelier, it\u0027s priceless. As I\u0027m taking it down, a woman catches me. She tells me to stop. It\u0027s her father\u0027s business; she\u0027s Tiffany. I say no. We make love all night. In the morning the cops come, and I escape in one of their uniforms. I tell her to meet me in Mexico, but I go to Canada - I don\u0027t trust her. Besides, I like the cold. Thirty years later, I get a postcard: I have a son, and he\u0027s the chief of police. This is where the story gets interesting. I tell Tiffany to meet me in Paris, by the Trocadéro. She\u0027s been waiting for me all these years, she\u0027s never taken another lover. I don\u0027t care. I don\u0027t show up. I go to Berlin. That\u0027s where I stashed the chandelier.",
            "Ingredients\n\n    1/2 cup + 2 tablespoons salted butter melted\n    1 cup granulated sugar\n    2 large eggs\n    2 teaspoons vanilla extract\n    1/2 cup melted milk chocolate chips\n    3/4 cup all-purpose flour\n    1/4 cup unsweetened cocoa powder\n    1/2 teaspoon salt\n    1 cup milk chocolate chips\nInstructions\n\n    Preheat oven to 350 degrees F. Line a metal 9x9 pan with parchment paper.\n    Pour melted butter into a large mixing bowl. Whisk in sugar by hand until smooth, 30 seconds.\n    Add in eggs and vanilla extract. Whisk 1 minute.\n    Whisk in melted chocolate until combined and smooth.\n    Use a rubber spatula to stir in flour, cocoa powder, and salt until just combined. Stir in whole chocolate chips.\n    Pour into prepared pan and smooth out.\n    Bake in the preheated oven for 30 minutes. Let cool in pan 30 minutes before slicing",
            "How to learn how to rock climb QUICKLY: Head to a rock gym or bouldering gym to safely learn basic skills and safety. You can also boulder outdoors, but you\u0027ll need to find out about safe, established bouldering sites before getting on a rock. Moreover, outdoor sites are usually more difficult, and require guides and deeper knowledge of rock formations. Rock gyms are safe, well-designed spaces for a variety of skill levels, and they often have classes and staff to help you learn. In general, you have two options starting out:\n\n    Bouldering routes are short rock climbing problems that don\u0027t require harnesses or ropes, and are a fantastic way to build your climbing skills safely, without complex introductions to belaying or equipment. Since these problems require no ropes certain constraints that come with roped climbing are avoided. Bouldering routes are great for learning to climb and are a fun way to climb although you lack the safety that you would have with a rope.\n    Top-roping is what most people think of when they think of rock climbing. You\u0027re tied in and scaling a large wall. In order to top-rope you\u0027ll need a partner. If you\u0027re brand new to the sport, check with the staff about \"belay partners,\" or boulder until you feel comfortable asking for a partner.[1]\n    Lead climbing is another common type of climbing used largely outdoors to ascend routes of different lengths. In lead climbing two climbers, or the “leader” and the “follower”, are tied in to opposite ends of a dynamic rope. The “leader” ascends first, clipping into bolts or placing their own protection periodically. When they reach the top of that section of the climb, or the “pitch”, the leader sets up their Personal Anchor System, and belays the “follower” up. Lead climbing is a more advanced form of rock climbing and requires detailed training and practice."
          ]
        }
      ],
      "defaultResponsePlatforms": {},
      "speech": []
    }
  ],
  "priority": 500000,
  "webhookUsed": false,
  "webhookForSlotFilling": false,
  "fallbackIntent": false,
  "events": []
}